

const posts = {
    namespaced: true,
    state: {
        posts: [
            {
                post_id: 1,
                img: "post_img.jpg",
                post_date: "2019-06-19",
                post_content: "ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります",
                post_title:
                    "サンプルテキストサンプル ルテキストサンプルテキストサンプルテキストサンプル ルテキスト",
            },
            {
                post_id: 2,
                img: "post_img.jpg",
                post_date: "2019-06-19",
                post_content: "ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります",
                post_title:
                    "サンプルテキストサンプル ルテキストサンプルテキストサンプルテキストサンプル ルテキスト",
            },
            {
                post_id: 3,
                img: "post_img.jpg",
                post_date: "2019-06-19",
                post_content: "ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります",
                post_title:
                    "サンプルテキストサンプル ルテキストサンプルテキストサンプルテキストサンプル ルテキスト",
            },
            {
                post_id: 4,
                img: "post_img.jpg",
                post_date: "2019-06-19",
                post_content: "ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります",
                post_title:
                    "サンプルテキストサンプル ルテキストサンプルテキストサンプルテキストサンプル ルテキスト",
            },
            {
                post_id: 5,
                img: "post_img.jpg",
                post_date: "2019-06-19",
                post_content: "ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります",
                post_title:
                    "サンプルテキストサンプル ルテキストサンプルテキストサンプルテキストサンプル ルテキスト",
            },
            {
                post_id: 6,
                img: "post_img.jpg",
                post_date: "2019-06-19",
                post_content: "ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります",
                post_title:
                    "サンプルテキストサンプル ルテキストサンプルテキストサンプルテキストサンプル ルテキスト",
            },
            {
                post_id: 7,
                img: "post_img.jpg",
                post_date: "2019-06-19",
                post_content: "ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります",
                post_title:
                    "サンプルテキストサンプル ルテキストサンプルテキストサンプルテキストサンプル ルテキスト",
            },
            {
                post_id: 8,
                img: "post_img.jpg",
                post_date: "2019-06-19",
                post_content: "ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります",
                post_title:
                    "サンプルテキストサンプル ルテキストサンプルテキストサンプルテキストサンプル ルテキスト",
            },
            {
                post_id: 9,
                img: "post_img.jpg",
                post_date: "2019-06-19",
                post_content: "ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります",
                post_title:
                    "サンプルテキストサンプル ルテキストサンプルテキストサンプルテキストサンプル ルテキスト",
            },
            {
                post_id: 10,
                img: "post_img.jpg",
                post_date: "2019-06-19",
                post_content: "ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります",
                post_title:
                    "サンプルテキストサンプル ルテキストサンプルテキストサンプルテキストサンプル ルテキスト",
            },
            {
                post_id: 11,
                img: "post_img.jpg",
                post_date: "2019-06-19",
                post_content: "ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります",
                post_title:
                    "サンプルテキストサンプル ルテキストサンプルテキストサンプルテキストサンプル ルテキスト",
            },
            {
                post_id: 12,
                img: "post_img.jpg",
                post_date: "2019-06-19",
                post_content: "ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります",
                post_title:
                    "サンプルテキストサンプル ルテキストサンプルテキストサンプルテキストサンプル ルテキスト",
            },
        ],

        comments: [
            {
                comment_id: 1,
                post_id: 1,
                comment_content: "ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります",
                comment_date: "2020-10-17"
            },
            {
                comment_id: 2,
                post_id: 1,
                comment_content: "ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります。ここにはテキストが入ります。ここにはテキストが入りますここにはテキストが入りますここにはテキストが入りますここにはテキストが入ります",
                comment_date: "2020-10-17"
            }

        ]
    },
    actions: {
        // get_all_data({ commit }) {
        //     return new Promise((resolve, reject) => {
        //         axios.get(burl + 'hosting/getall').then((response) => {
        //             if (response.data.code == 200) {
        //                 setTimeout(() => {
        //                     commit('SET_HOSTING', response.data)
        //                     resolve(response.data)

        //                 }, 1000);

        //             } else {
        //                 reject(response.data)
        //             }
        //         })
        //     })
        // }
        set_comment({ commit }, payload) {
            console.log(payload)
            commit('SET_COMMENT', payload)
        }
    },
    getters: {
        get_post: (state) => id => {
            return state.posts.find((post) => (post.post_id == id))
        },
        get_all_posts: (state) => {
            return state.posts;
        },
        get_comments: (state) => id => {
            console.log(id)
            return state.comments.filter((comm) => (comm.post_id == id))
        },

    },
    mutations: {
        SET_POST(state, dd) {
            state.header_page.name = dd
        },
        SET_COMMENT(state, dd) {

            // let getDates = function () {
            //     let dt = new Date()
            //     return dt.getFullYear() + "-" + (dt.getMonth() + 1) + "-" + ((dt.getDate().toString().length == 1) ? "0" + (dt.getDate()) : (dt.getDate()))
            // }

            let comment_data = {
                comment_id: state.comments.length + 1,
                post_id: dd.post_id,
                comment_content: dd.comment,
                comment_date: new Date()
            }
            state.comments.push(comment_data)
        }
    }
}

export default posts